# brew "curl"           # replaced wget with curl because wget is old and slow
# brew "magic-wormhole" # easy PAKE-based file transfer
brew "gron"           # grep json easily
brew "viddy"          # modern watch command
brew "tig"            # git tui client
brew "bat"            # cat replacement
brew "lsd"            # ls replacement (was exa)
brew "fd"             # find replacement
brew "ripgrep"        # better grep
brew "dust"           # better du replacement
brew "hexyl"          # hex viewer
brew "choose-rust"    # cut replacement
brew "watchexec"      # run cmd on fs change
brew "gh"             # github cli
# brew "minisign"       # ec25519 signature verification
brew "git-delta"      # git diff parser
brew "broot"          # new shake on 'tree'
brew "zoxide"         # smarter cd, z jumping
brew "tre-command"    # better tree command
brew "lazygit"        # way better git UI
brew "mosh" 		  # better ssh
brew "jq" 			  # json parsing
brew "fzf"            # fuzzy finder
brew "hl"             # log file highlighter

# fonts (now in main cask repo, no tap needed)
cask "font-meslo-lg-nerd-font"
